terms = ['ᾄλλα', 'ἐκ', 'μαθητής', 'αὐτὀς', 'αὐτῷ', 'αὐτού', 'ἐάν', 'ἐάν μὴ',
         'εἰ', 'εἰ μὴ', 'ἐγώ', 'εἶναι', 'ἤμην', 'εἶμι', 'ῂμεἰς', 'ἴνα μῂ', 'ὅς',
         'οὗτος', 'τοῦτο', 'τούτου', 'τούτῳ', 'τοῦτον', 'ταῦτα', 'ἔχειν',
         'ὰγαπᾶν', 'αὶώνιος', 'ὰλήθεια', 'ὰληθής', 'ὰμήν', 'ὰποθνῄσκειν', 'ὰποχρίνεσθαι', 'ἄρτι',
         'γεννᾶν', 'γινώσχειν', 'γιδόναι', 'ἐοξάζειν', 'ἐγγός', 'ἔκεῖνος', 'ἐμαυτοῦ', 'ἐμός', 'ἐντολή',
         'ἒορτή', 'ἒργον', 'ἔρχεσθαι', 'ἒρωτᾶν', 'ζῆν', 'ζετεῖν', 'ζωή', 'ῆδη', 'θεωρεῖν', 'ἴδε', 'Ιησοῦς',
         'ἵνα', 'ιουδαῖος', 'καγώ', 'καθώς', 'κόσμος', 'κρίνειν', 'κρίσις', 'Λάζαρος', 'λαλεῖν', 'λαμβάνειν',
         'μαρτυρεῖν', 'μαρτυρία', 'μένειν', 'μισεῖν', 'μνεμεῖον', 'νίπτειν', 'νῦν', 'οἶδα',
         'ὄπου', 'ὁρᾶν', 'ὄτε', 'ὅτι', 'οὐ','σύ', 'οὐδείς', 'οὖν', 'οὔπω']

prepositions = ['ἐν', 'παρά', 'περί', 'πρό', 'ἀπό', 'ἐπί', 'κατά', 'ἐκ', 'εἰσ']

deounlist = ['οὖν', 'δέ']

print(len(terms))