lexemes = ['ἀλλά', 'ἐκ', 'μαθητής',
         'ἐγώ', 'εἰμί', 'ἵνα',
         'οὗτος', 'ἔχω',
         'ἀγαπάω', 'αἰώνιος', 'ἀλήθεια', 'ἀληθής', 'ἀμήν', 'ἀποθνήσκω', 'ἀποκρίνω', 'ἄρτι',
         'γεννάω', 'γινώσκω', 'δοξάζω', 'ἐγγύς', 'ἐκεῖνος', 'ἐμαυτοῦ', 'ἐμός', 'ἐντολή',
         'ἑορτή', 'ἔργον', 'ἔρχομαι', 'ἐρωτάω', 'ζάω', 'ζητέω', 'ζωή', 'ἤδη', 'θεωρέω', 'ἴδε', 'Ἰησοῦς',
         'ἵνα', 'Ἰουδαῖος', 'κἀγώ', 'καθώς', 'κόσμος', 'κρίνω', 'κρίσις', 'Λάζαρος', 'λαλέω', 'λαμβάνω',
              'μαρτυρέω', 'μαρτυρία', 'μένω', 'μισέω', 'μνημεῖον', 'νίπτω', 'νῦν', 'εἴδω',
         'ὅπου', 'ὁράω', 'ὅτε', 'ὅτι', 'οὐ','σύ', 'οὐδείς', 'οὖν', 'οὔπω']

#Inccorect
OGNToWords = ['ἀλλά', 'ἐκ', 'μαθητής',
         'ἐγώ', 'εἶναι', 'ἤμην', 'ἡμεῖς', 'ἵνα',
         'οὗτος', 'ἔχειν',
         'ἠγάπα', 'αἰώνιος', 'ἀλήθεια', 'ἀληθής', 'ἀμήν', 'ἀποθνήσκειν', 'ὰποχρίνεσθαι', 'ἄρτι',
         'γεννάω', 'γινώσκω', 'ἐδοξάσθη', 'ἐγγὺς', 'ἐκεῖνος', 'ἐμαυτοῦ', 'ἐμός', 'ἐντολή',
         'ἑορτὴ', 'ἔργον', 'ἔρχεσθαι', 'ἐρωτᾶν', 'ζῇ', 'ζητέω', 'ζωή', 'ἤδη', 'θεωρέω', 'ἴδε', 'Ἰησοῦς',
         'ἵνα', 'Ἰουδαῖος', 'κἀγὼ', 'καθώς', 'κόσμος', 'κρίνειν', 'κρίσις', 'Λάζαρος', 'λαλεῖν', 'λαμβάνειν',
              'μαρτυρεῖ', 'μαρτυρία', 'μένειν', 'μισεῖν', 'μνημεῖον', 'νίπτειν', 'νῦν', 'οἶδα',
         'ὅπου', 'ὁράω', 'Ὅτε', 'ὅτι', 'οὐ','σύ', 'οὐδείς', 'οὖν', 'οὔπω']

prepositions = ['ἐν', 'παρά', 'περί', 'πρό', 'ἀπό', 'ἐπί', 'κατά', 'ἐκ', 'εἰς']

deounlist = ['οὖν', 'δέ']

otherList = ['αὐτού', 'αὐτὀς', 'αὐτῷ', 'εἰ', 'εἰ μὴ', 'τοῦτο', 'τούτου', 'τούτῳ', 'τοῦτον', 'ταῦτα', 'ἐάν', 'ἐάν μὴ', 'ὅς']

#γεννᾶν is not found anywhere in NT probasbly should be Gennaoo but Morgenthaler has the former
#None of the syllables of γιδόναι can i find in GJhon Morgenthaler reports 76: γίνομαι?
#ζετεῖν not found anywhere in gospel replaced with ζητέite
#ζῆν can't found out this one ζάω replaced it but only found 3 times according to MThaler should be found 17 in GJOHN
#μαρτυρεῖv zonder slot n
#ἐδοξάσθη twijfelgeval ἑορτὴ ook
#Oran = ὁράω?
#Gevonden maar staatdit goed in Beran?
#ἠγάπαv is ἠγάπα?
#ὰποχρίνεσθαι is Ἀπεκρίθη?
# is ἡμεῖς?

print(len(OGNToWords))